transport_dev/src/app/models/application.rb

  def no_duplicate_application
    if Application.exists?(user: user, job: job, status: Application.statuses.except("withdrawn").keys)
---
SELECT 1 AS one FROM `applications` WHERE `applications`.`user_id` IS NULL AND `applications`.`job_id` IS NULL AND `applications`.`status` IN (0, 1, 2, 3) LIMIT 1